{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "consulter_solde",
    "1": "declarer_panne",
    "2": "demander_agent_humain",
    "3": "hors_scope",
    "4": "info_forfait",
    "5": "reclamer_facture",
    "6": "recuperer_mot_de_passe",
    "7": "remerciements",
    "8": "salutations"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "consulter_solde": 0,
    "declarer_panne": 1,
    "demander_agent_humain": 2,
    "hors_scope": 3,
    "info_forfait": 4,
    "reclamer_facture": 5,
    "recuperer_mot_de_passe": 6,
    "remerciements": 7,
    "salutations": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 100000
}
